{"posts":[{"title":"Exam Timer 使用說明","text":"段考倒數計時器，就如同他的名字，他是在段考的時候用來倒數計時的工具。 這個工具大致分為幾個功能： 1.當前時間2.考程表（包含換班提醒）3.當節科目及當節剩餘時間4.下節考試項目及距下節時間5.座位表6.全螢幕 功能介紹一、當前時間顯示於「Exam Timer」下方，時間從電腦系統取得，基本上為準確時間。 二、考程表按下add subject按鈕 於輸入欄分別填入科目、換班與否、開始時間、結束時間，按下「Save」後將顯示於時間下方，內容將顯示在左側，方便查看。 三、當前科目及當節剩餘時間當時間到該科目的開始時間，就會顯示目前的考試科目，與剩餘時間同樣顯示於時間下方，靠右。 根據用戶輸入的結束時間，自動計算當節科目剩餘時間，每分鐘更新一次。 提醒： 開始時間以學校鐘聲為主，此功能僅作為參考，學校鐘聲時間可能會有誤差。 四、下節考試科目於非考試時間（下課時間）顯示下節考試科目，方便預覽下一科考試內容。 若下節沒有科目，則顯示「全部結束」。 五、座位表將座位表以實物投影機截圖保存成檔案，或直接上傳檔案至電腦，會於選取其檔案後顯示於輸入框下。 六、全螢幕按下後進入全螢幕模式，退出請按 Esc鍵。 問題解決辦法1.輸入錯誤輸入錯誤後無法直接修改，需刷新頁面並重新輸入全部之資料。 2.刷新即消失此工具無記憶模式，請避免在未保存的情況下關閉頁面。 3.無全螢幕按鈕至網頁選單內選擇全螢幕或按下鍵盤上的F11即可。 特別提醒此工具僅用於學習輔助用途，請勿用於其他非正當用途或商業獲利意圖。 本專案由東山程式研究社第三屆教學 王藝涵製作。如有問題或建議，歡迎聯繫並提出，感謝支持！ 聯絡信箱: yihan970317@gmail.com","link":"/2024/10/28/Exam-Timer/"},{"title":"教學，也是焦學","text":"在站上教學這個位置前，我從沒想過，「教」的同時，其實也在「學」。從學怎麼教學，到學怎麼帶人，甚至學怎麼和自己的焦慮共處。在這段時間中，被迫經歷了成長，面對了那些懷疑與孤獨，不是很順遂，卻是很有價值的一段經歷。 教學，這個職位，對我來說，代表什麼？是責任、是信任。 交接時，學長曾說：「在程研中，教學這個職位是最重要的。」程研是一個學術性質的社團，能力，是我們最看重的事之一。如何讓社團變得更強、更被看見，很大一部分，其實就取決於我們怎麼去教、怎麼去帶。 剛進程研的我，雖然有基礎程式能力，但完全沒有開發經驗，踏進這個陌生環境，本身就是一次很大的挑戰。 2024年的三月底、四月初，第二屆的教學長找到我，問我當教學的意願，那時的我其實很迷茫。身邊一群高手，而我連每堂的社課，常常都是有聽、沒有懂，我不懂為什麼會找我，這完全會是一步險棋。 感謝他們的信任的同時，也背負上了很大的壓力，很怕辜負他們的期望。 只是走得比較慢，就代表我很爛？剛接下教學時，我其實還不知道自己要往哪裡走。離第一次社課越來越近，我越來越焦慮，不知道自己能教什麼，也不確定自己是否有足夠的能力站在講台上。 直到一次偶然的契機，我接觸到了網頁設計。從最基礎的 HTML、CSS、JavaScript，到後來的後端 Express.js，我開始一步一步學習、慢慢嘗試做出屬於自己的小專案。 這個過程並不快，有時甚至很慢，但我知道自己正在往前走。 每個人學習的速度不同，別人比你早起步，不代表你一直會比他們爛。在教學的過程中，我曾因為進度比別人慢而感到自卑，但我後來明白，比起別人的眼光， 「你學到了什麼」才是真正重要的。 他們不會看見你對自己的嚴厲，不會知道你為了把課講清楚，反覆練習，甚至演練了上百次。但你所累積的實力，不會因為別人的看法就此消失。 走得慢沒有關係，因為你一直在走。 你沒有錯，只是用屬於自己的步調，走在一條沒人替你規劃好的路上。而這樣的堅持，本身就是一種很大的成長。 那你呢，你有做到很好嗎？我曾聽過質疑，也許那是事實。 我的同事們，也就是我這屆的幹部，有時若有若無地透露出 「你真的夠格嗎」的感覺，每次都用一句玩笑話帶過，好像我真的會相信那只是玩笑。但其實我心裡清楚，那些話，是說給我聽的。是啊，我沒有做得很好，我的能力真的不如他們。因此，我陷入一段長時間的自我懷疑，即使學長、老師都說我比一年前進步很多，這樣的成長已經遠超他們的預期，但也許就是因為看著他們的優秀，我總覺得自己還不好。 這樣的聲音不斷在心裡打轉：「別人那麼強，我這樣可以嗎？我是不是沒辦法交給學弟妹很多知識？」 但我漸漸發現，每個人擅長的領域不一樣，我也有有別於他們的能力，他們的領域我不熟悉，並不代表我一無是處。比起否定自己，不如去看看自己走了多遠、學了多少、撐過了哪些時候。 「在教與學的過程中，去尋找那個自我。」這句話是第二屆教學長在社團聚餐結束後對我說的。在準備交接給下一屆的現在，我終於懂了。 每個人的教學方式都不同，有人用比喻，有人重視理論，有人靠實作。 教學沒有標準答案，也沒有絕對的對與錯。你的理念，也許和他們不同，但不一定是你比較差。 回頭看這一路走來的自己，我發現我也漸漸找到自己的步調。 不像上台報告只要把內容講完，教學是一場又一場的修正與練習，是一次次去理解別人的吸收方式，再轉換成他們能聽懂的語言。 而你，希望帶給他們的，又是什麼？我很常問學弟妹一句話：「你的初衷是什麼？」因為我也一直在問自己這句話。唯有記得最初的那份熱忱，才不會在比較與焦慮中迷失方向，才能在這條路上走得更久、更穩。 焦慮與學習在一次次的挫敗中，我開始學會與自己和解，學會了如何面對自己的不安與懷疑。這或許也是我在程研最需要學會的課題之一。 程研基本上都是男生，面對第二屆與第三屆的「3+1」，我始終如是那個「1」，我沒有夥伴，沒有可以依靠的人。 我常常會想，如果當初沒有遇到願意拉我一把的學長、願意支持我的老師，我是不是早就撐不下去了？ 但現實中不會有那麼多如果，不管遇到了什麼，去面對，去解決。 當時間過去，回頭看到那個勇敢踏進未知世界的自己，想對他說一聲：謝謝，加油。 未來會怎樣，沒有人知道。但我知道的是，只要你願意去嘗試、去付出、去突破，就算短時間看不到結果，終有一天，努力會開花。 「不要因為逆風，抵擋那個想飛翔的你。」 送給看完這篇的你，也送給一直努力的我們。","link":"/2025/06/15/%E6%95%99%E5%AD%B8%EF%BC%8C%E4%B9%9F%E6%98%AF%E7%84%A6%E5%AD%B8/"},{"title":"數位時代，AI是對手還是隊友","text":"在這個生成式AI盛行的時代，你是否一邊依靠著它，又一邊擔心被它取代？ 近年來AI發展迅速，遇到問題不再只是詢問Google，越來越多人傾向尋求生成式AI的解答。「工作會不會被取代？」成為熱門的話題。隨著技術發展，AI逐漸具備在極短時間寫出小工具、網頁，甚至小型遊戲的能力，在普遍認知中，較不易被取代的工程師也將面臨就業危機。 但情況真的有那麼嚴重嗎？ AI在達成指令上，效率無庸置疑，然而正確性卻存有疑慮。AI的回覆並非真正的「理解」，而是基於大量的資料學習後，推測出可能符合的答案，只要詢問時有些微的語句差異，就可能導致回答偏離真正需求。有些交給AI的任務，即使反覆請求修改，仍難以達成預期的標準與期望。這並非質疑AI的能力，而是它不具備人類的思維模式，不見得能精準掌握人們的指令。 從工程師的角度來看，善用AI，不抗拒也不過度依賴，是這個時代很重要的能力。專案開發中決定其價值的往往是背後的創意及構思，「創新能力」始終是關鍵，然而這正是目前AI不擅長的領域，它會結合、模仿，唯獨無法創造出全新的東西。 在專案開發中，你可以利用它快速建立框架，處理重複繁瑣的部分，再搭配自身的想法與創意，做些微的修改與優化，結合各自的能力，就有機會在短時間內創造出更有價值的作品。不過這也代表 「學會如何與AI溝通」是發揮它最大效能的關鍵，畢竟它只會解決問題，並不會主動問問題。 舉例來說，當你隨意丟出一段模糊的指令：「請製作出我們社團的網站」，AI無法理解你的真正需求；而若是「請製作一個程式相關社團的形象網站，主要用途是在介紹社團，並可讓擁有者發布一些程式相關介紹文章」，具體地表達你期望的目標，有助於減少因誤解而反覆修改所浪費的時間。使用AI就像和工作夥伴溝通，清楚、具體、有效的表達，才能讓它成為你的助力，而不是雷隊友。 所以說，AI真的會取代我們嗎？ 這個問題的答案並不絕對，在人力銀行2024年發布的報導中提到，國泰開發了智能服務，提供部門約75%的量能，但由於人工客服能處理更複雜的問題，且在面對特殊客戶時可以提供更貼心、靈活的應對，人工客服的數量並未因此減少。 AI確實會取代基礎的操作型職業，但你是否淪為其中的一員，取決於你是否具備無可取代的創造力。與其一昧過度擔憂，不如主動提升自己，讓你的價值超越機器，並善用它，把它訓練成你的神隊友。","link":"/2025/06/05/%E6%95%B8%E4%BD%8D%E6%99%82%E4%BB%A3%EF%BC%8CAI%E6%98%AF%E5%B0%8D%E6%89%8B%E9%82%84%E6%98%AF%E9%9A%8A%E5%8F%8B/"}],"tags":[{"name":"文章","slug":"文章","link":"/tags/%E6%96%87%E7%AB%A0/"},{"name":"經驗分享","slug":"經驗分享","link":"/tags/%E7%B6%93%E9%A9%97%E5%88%86%E4%BA%AB/"},{"name":"Exam Timer","slug":"Exam-Timer","link":"/tags/Exam-Timer/"},{"name":"資訊領域","slug":"資訊領域","link":"/tags/%E8%B3%87%E8%A8%8A%E9%A0%98%E5%9F%9F/"},{"name":"使用教學","slug":"使用教學","link":"/tags/%E4%BD%BF%E7%94%A8%E6%95%99%E5%AD%B8/"}],"categories":[],"pages":[{"title":"About","text":"我是 Sunny 涵，目前為東山高級中學二信的資訊股長及班級學生代表，曾任東山高中程式研究社第三屆教學。 在資訊領域，我對網頁設計較有興趣，自學過些許前端及後端，寫過Exam Timer 及正在撰寫其他相關專案，歡迎對網頁有興趣的人可以來跟我聊天、互相切磋，假如想要學，也可以來請教喔 ! 程式語言的話，我學過C++及Python，但我跟C++比較熟，有Python的問題不要問我喔。","link":"/about/index.html"}]}