{"posts":[{"title":"12-11程研上課檢討","text":"這次算是第二次上台講課吧… 這次的狀況依舊沒有很好，我以為我已經準備很多了，但真的坐在講台上的電腦前，頭腦出現一片空白… 該講的不是忘了講，就是講的沒有很清楚，可能是練習不夠，可能是上台經驗不足，我原本對講台的恐懼依舊尚未改善。 首先，第一個問題，講太快。 可能是我本身的語速就比較快，再加上有點緊張，所以就劈裡啪啦一直講下去。 再來，是順暢度的問題。 我覺得這個跟不夠熟有很大的關係，我在練習的時候沒有真的實際走過一次流程，所以在上課的時候常常卡住，那時候幹訓就說過了，一直卡住，會讓人不想聽，我也知道這個道理，或許這個問題是難免的，但它是我要著重改善的問題。 其次，我整個後背發涼、冒冷汗。 我也不知道為什麼，但真的很不舒服，很想逃離，很怕講錯，很怕被議論，我覺得我必須課輔自己的恐懼… 我覺得上台實際演練真的很重要，你在練習的時候，你永遠預想不到上台會發生什麼，你不知道自己實際在台上會是什麼感覺，教一個人跟教一群人是很不一樣的，一個人你可以去針對個人的問題去講，可是教一群人，他們可能有各式各樣的問題，而你又不可能顧及到每個人。 「要做就要做到最好」 這是某次我跟一個朋友聊天時聽到的話，對啊，要做就要做到最好，我要爭取在每次上台時有更好的表現，把我想教的東西，交給這個社團。","link":"/2024/12/16/12-11%E7%A8%8B%E7%A0%94%E4%B8%8A%E8%AA%B2%E6%AA%A2%E8%A8%8E/"},{"title":"2024 review","text":"2024年對我來說很特別 很特別這年看著自己的成長莫名感觸很多 看著自己克服恐男（？（這一年大概是我目前人生中跟男生講最多話的一年了吧🤣 今年進了程研 真的學到了很多從對「開發」趨近於零的基礎到後來自己寫出一份小專案跟blog從對講台的恐懼到後來講課逐漸變順（想起第一次還在冒冷汗的我… 這一年認識了好多好多人有些人只有短短的緣分 有些人意外的很聊得來 謝謝今年遇到的所有人事物或許有很多挫折 有很多emo但這之中我學到了很多 p.s. 真的不怎麼想面對2025 明年的這時候應該緊張的要命吧","link":"/2025/01/01/2024-review/"},{"title":"Exam Timer 使用說明","text":"段考倒數計時器，就如同他的名字，他是在段考的時候用來倒數計時的工具。 這個工具大致分為幾個功能： 1.當前時間2.考程表（包含換班提醒）3.當節科目4.當節剩餘時間5.下節考試項目6.座位表（待開發） 功能介紹一、當前時間顯示於「Exam Timer」下方，時間從電腦系統取得，基本上為準確時間。 二、考程表於輸入欄分別填入科目、換班與否、開始時間、結束時間，按下「Save」後將顯示於時間下方，內容將顯示在左側，方便查看。 三、當前科目當時間到該科目的開始時間，就會顯示目前的考試科目，與剩餘時間同樣顯示於時間下方，靠右。 四、當節剩餘時間根據用戶輸入的結束時間，自動計算當節科目剩餘時間，每分鐘更新一次。 提醒： 開始時間以學校鐘聲為主，此功能僅作為參考，學校鐘聲時間可能會有誤差。 五、下節考試科目於非考試時間（下課時間）顯示下節考試科目，方便預覽下一科考試內容。 問題解決辦法1.輸入錯誤輸入錯誤後無法直接修改，需刷新頁面並重新輸入。 2.刷新即消失此工具無記憶模式，請避免在未保存的情況下關閉頁面。 3.沒全螢幕按鈕至網頁選單內選擇全螢幕即可。 特別提醒此工具僅用於學習輔助用途，請勿用於其他非正當用途或商業獲利意圖。本專案由東山程式研究社第三屆教學 王藝涵製作。如有問題或建議，歡迎聯繫並提出，感謝支持！","link":"/2024/10/28/Exam-Timer/"},{"title":"Heart","text":"或許大家都覺得程式圖形很好畫，但對我來說，它是一大挑戰。 這幾天持續的情緒低落，昨天自習課時，真的讀不下去書，腦袋中跑出了一個想法:不如來手寫程式碼吧!於是行動派的我就開始畫了草稿。 從畫圖到統整出規律，我比平常更多的耐心去投入，在這當中，不斷思考，它沒有帶給我平常的不耐煩，反而我很興奮。 或許是寫程式的熟悉感，讓我在這次的情緒中可以有個發洩，終於我完成了它，成功時的喜悅，是很強大的。 其實在這段學程式的途中，我不斷的想過放棄，但或許就是每次成功帶給我的喜悅，讓我撐到了現在吧。 接下來我來展示一下我的成品","link":"/2024/12/04/heart/"}],"tags":[],"categories":[],"pages":[{"title":"","text":"my url #show { display: none; } Score editing sign in Enter score editing function enter(){ var enter = document.getElementById(\"sign\").value; if (enter === \"sunny0317\") show.style.display = 'block'; }","link":"/score.html"},{"title":"About","text":"哈囉! 我是涵，目前為 東山程式研究社的教學、二年信班的資訊股長及班級學生代表，有接觸 C++ &amp; Pyhton，最近正在學習網頁的開發。","link":"/about/index.html"}]}